In [63]:
import pandas as pd
import openpyxl
import xlrd
import numpy as np

In [8]:
data = { "E_Name" : ["Tushar", "Tarun", "Chaittanya", "Sanjeev"],
        "Salary" : [10000, 20000, 30000, 40000],
        "Department" : ["Finance", "HR", "Teaching", "LIC"],
        "Age" : [36,33,35,30]}

In [9]:
df1 = pd.DataFrame(data)
print(df1)

       E_Name  Salary Department  Age
0      Tushar   10000    Finance   36
1       Tarun   20000         HR   33
2  Chaittanya   30000   Teaching   35
3     Sanjeev   40000        LIC   30

In [11]:
df1 = pd.DataFrame(data, index=["E1", "E2", "E3","E4"])
print(df1)

        E_Name  Salary Department  Age
E1      Tushar   10000    Finance   36
E2       Tarun   20000         HR   33
E3  Chaittanya   30000   Teaching   35
E4     Sanjeev   40000        LIC   30

Reading Files and set index to column

In [14]:
df2 = pd.read_csv("D:/Python/jupyter/company1.csv", index_col= "EEID")
print(df2)

           Name gender   salary
EEID
EMP01    ayushi      F      NaN
EMP02     rohit      M  25000.0
EMP03  pranjali    NaN  27000.0
EMP01    ayushi      F  20000.0
EMP05       NaN      M  25000.0
EMP06     rohit      M      NaN
EMP02     rohit      M  25000.0

Head and Tail

In [16]:
df2.head(3)

           Name gender   salary
EEID
EMP01    ayushi      F      NaN
EMP02     rohit      M  25000.0
EMP03  pranjali    NaN  27000.0

In [17]:
df2.tail(2)

        Name gender   salary
EEID
EMP06  rohit      M      NaN
EMP02  rohit      M  25000.0

To see columns

In [18]:
df2.columns

Index(['Name', 'gender', 'salary'], dtype='object')

Information about table

In [20]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, EMP01 to EMP02
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   gender  6 non-null      object
 2   salary  5 non-null      float64
dtypes: float64(1), object(2)
memory usage: 524.0+ bytes

datatype

In [23]:
df2.dtypes

Name       object
gender     object
salary    float64
dtype: object

Set Index

In [24]:
df2.set_index("gender")

            Name   salary
gender
F         ayushi      NaN
M          rohit  25000.0
NaN     pranjali  27000.0
F         ayushi  20000.0
M            NaN  25000.0
M          rohit      NaN
M          rohit  25000.0

sorting values

In [36]:
df3 = pd.read_csv("D:/Python/jupyter/company1.csv")
print(df3)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [38]:
df3.sort_values(by="salary", ascending=False)

    EEID      Name gender   salary
2  EMP03  pranjali    NaN  27000.0
1  EMP02     rohit      M  25000.0
4  EMP05       NaN      M  25000.0
6  EMP02     rohit      M  25000.0
3  EMP01    ayushi      F  20000.0
0  EMP01    ayushi      F      NaN
5  EMP06     rohit      M      NaN

Sort Index

In [39]:
df3.sort_index(ascending=False)

    EEID      Name gender   salary
6  EMP02     rohit      M  25000.0
5  EMP06     rohit      M      NaN
4  EMP05       NaN      M  25000.0
3  EMP01    ayushi      F  20000.0
2  EMP03  pranjali    NaN  27000.0
1  EMP02     rohit      M  25000.0
0  EMP01    ayushi      F      NaN

From table choosing values

In [44]:
df3["EEID"]

0    EMP01
1    EMP02
2    EMP03
3    EMP01
4    EMP05
5    EMP06
6    EMP02
Name: EEID, dtype: object

In [45]:
df3[["EEID", "Name", "gender"]]

    EEID      Name gender
0  EMP01    ayushi      F
1  EMP02     rohit      M
2  EMP03  pranjali    NaN
3  EMP01    ayushi      F
4  EMP05       NaN      M
5  EMP06     rohit      M
6  EMP02     rohit      M

Filter Functions

In [46]:
df3[df3["gender"]== "F"]

    EEID    Name gender   salary
0  EMP01  ayushi      F      NaN
3  EMP01  ayushi      F  20000.0

In [49]:
df4= df3[(df3["Name"]== "rohit") & (df3["salary"] >20000)]
print(df4)

    EEID   Name gender   salary
1  EMP02  rohit      M  25000.0
6  EMP02  rohit      M  25000.0

LOC and ILOC function

In [50]:
df5 = pd.read_csv("D:/Python/jupyter/company1.csv")
print(df5)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN
6  EMP02     rohit      M  25000.0

In [52]:
df5.iloc[0:5, 0:2]

    EEID      Name
0  EMP01    ayushi
1  EMP02     rohit
2  EMP03  pranjali
3  EMP01    ayushi
4  EMP05       NaN

In [53]:
df5.iloc[[0,3,6], [0 ,2, 3]]

    EEID gender   salary
0  EMP01      F      NaN
3  EMP01      F  20000.0
6  EMP02      M  25000.0

In [56]:
df5.loc[:,["EEID", "gender"]]

    EEID gender
0  EMP01      F
1  EMP02      M
2  EMP03    NaN
3  EMP01      F
4  EMP05      M
5  EMP06      M
6  EMP02      M

In [57]:
df5.loc[[0,1,3,6], ["EEID", "Name"]]

    EEID    Name
0  EMP01  ayushi
1  EMP02   rohit
3  EMP01  ayushi
6  EMP02   rohit

In [59]:
df5.loc[0:5,df5.columns[0:2]]

    EEID      Name
0  EMP01    ayushi
1  EMP02     rohit
2  EMP03  pranjali
3  EMP01    ayushi
4  EMP05       NaN
5  EMP06     rohit

Creating csv ao excel file

In [61]:
df5.to_csv("First csv File created.csv", index=False, header=None)

In [62]:
df5.to_excel("First csv File created.xlsx", index=False, header=None)

Duplicates removal

In [68]:
df6 =df5[df5.duplicated()]
print(df6)

    EEID   Name gender   salary
6  EMP02  rohit      M  25000.0

In [69]:
df6 =df5[df5.duplicated(subset= "Name")]
print(df6)

    EEID    Name gender   salary
3  EMP01  ayushi      F  20000.0
5  EMP06   rohit      M      NaN
6  EMP02   rohit      M  25000.0

In [70]:
df6 =df5[df5.duplicated(subset= ["Name", "gender"])]
print(df6)

    EEID    Name gender   salary
3  EMP01  ayushi      F  20000.0
5  EMP06   rohit      M      NaN
6  EMP02   rohit      M  25000.0

In [75]:
df6 = df5[df5.duplicated(subset="Name", keep="first")]   #dont use inplace= false
print(df6)

    EEID    Name gender   salary
3  EMP01  ayushi      F  20000.0
5  EMP06   rohit      M      NaN
6  EMP02   rohit      M  25000.0

Remove duplicates

In [90]:
df5_updated = df6.drop_duplicates(subset="Name")
print(df5_updated)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
4  EMP05       NaN      M  25000.0

In [93]:
df5_updated = df6.drop_duplicates(subset=["Name","salary"]) # can use inplace = true
print(df5_updated)

    EEID      Name gender   salary
0  EMP01    ayushi      F      NaN
1  EMP02     rohit      M  25000.0
2  EMP03  pranjali    NaN  27000.0
3  EMP01    ayushi      F  20000.0
4  EMP05       NaN      M  25000.0
5  EMP06     rohit      M      NaN

Null Removing and handeling

In [94]:
data1 = { "E_Name" : ["Tushar", "Tarun", "Chaittanya", "Sanjeev", np.nan],
        "Salary" : [10000, 20000, np.nan,30000, 40000],
        "Department" : ["Finance", "HR", "Teaching", np.nan, "LIC"],
        "Age" : [36,33,35,30, np.nan]}
df8= pd.DataFrame(data1)
print(df8)

       E_Name   Salary Department   Age
0      Tushar  10000.0    Finance  36.0
1       Tarun  20000.0         HR  33.0
2  Chaittanya      NaN   Teaching  35.0
3     Sanjeev  30000.0        NaN  30.0
4         NaN  40000.0        LIC   NaN

In [95]:
null_count = df8.isnull().sum()  # Add parentheses to call the method
print(null_count)

E_Name        1
Salary        1
Department    1
Age           1
dtype: int64

In [100]:
df8["Salary"].isnull()

0    False
1    False
2     True
3    False
4    False
Name: Salary, dtype: bool

In [102]:
df8.dropna()

   E_Name   Salary Department   Age
0  Tushar  10000.0    Finance  36.0
1   Tarun  20000.0         HR  33.0

In [103]:
df8.dropna(subset="Salary")

    E_Name   Salary Department   Age
0   Tushar  10000.0    Finance  36.0
1    Tarun  20000.0         HR  33.0
3  Sanjeev  30000.0        NaN  30.0
4      NaN  40000.0        LIC   NaN

sum mean etc

In [107]:
df9 =df8["Salary"].sum()
print(df9)

df9 =df8["Salary"].mean()
print(df9)

100000.0
25000.0

Fill Na method

In [108]:
df8.fillna(0)

       E_Name   Salary Department   Age
0      Tushar  10000.0    Finance  36.0
1       Tarun  20000.0         HR  33.0
2  Chaittanya      0.0   Teaching  35.0
3     Sanjeev  30000.0          0  30.0
4           0  40000.0        LIC   0.0

In [114]:
df8["Salary"] = df8["Salary"].fillna(df8["Salary"].mean())
print(df8)

       E_Name   Salary Department   Age
0      Tushar  10000.0    Finance  36.0
1       Tarun  20000.0         HR  33.0
2  Chaittanya  25000.0   Teaching  35.0
3     Sanjeev  30000.0        NaN  30.0
4         NaN  40000.0        LIC   NaN

Replace function

In [115]:
df8.replace(np.nan, 0)

       E_Name   Salary Department   Age
0      Tushar  10000.0    Finance  36.0
1       Tarun  20000.0         HR  33.0
2  Chaittanya  25000.0   Teaching  35.0
3     Sanjeev  30000.0          0  30.0
4           0  40000.0        LIC   0.0

In [124]:
df9 =df8.replace({np.nan : 111})
print(df9)

       E_Name   Salary Department    Age
0      Tushar  10000.0    Finance   36.0
1       Tarun  20000.0         HR   33.0
2  Chaittanya  25000.0   Teaching   35.0
3     Sanjeev  30000.0        111   30.0
4         111  40000.0        LIC  111.0

Drop columns

In [125]:
df8.drop(columns=["Salary", "Department"])

       E_Name   Age
0      Tushar  36.0
1       Tarun  33.0
2  Chaittanya  35.0
3     Sanjeev  30.0
4         NaN   NaN

rename column

In [126]:
df8.rename(columns={"Salary" : "E_Salary"})

       E_Name  E_Salary Department   Age
0      Tushar   10000.0    Finance  36.0
1       Tarun   20000.0         HR  33.0
2  Chaittanya   25000.0   Teaching  35.0
3     Sanjeev   30000.0        NaN  30.0
4         NaN   40000.0        LIC   NaN

Datatype change

In [127]:
#astype
df8["Salary"].astype(int)

0    10000
1    20000
2    25000
3    30000
4    40000
Name: Salary, dtype: int64

merge join and concat

In [131]:
data3 = {"EMP_ID" : ["E01","E02","E03","E04","E05"],
         "Names" : ["Ram","Shyam","Ghansham","Tushar","Tarun"],
         "Age" : [34,44,35,39,44]
         }
data4 = {"EMP_ID" : ["E01","E02","E03","E04","E05"],
         "Salary" :[35000, 45000, 55000,65000, 75000]
}
dd1 = pd.DataFrame(data3)
dd2 = pd.DataFrame(data4)
print(dd1)
print(dd2)

  EMP_ID     Names  Age
0    E01       Ram   34
1    E02     Shyam   44
2    E03  Ghansham   35
3    E04    Tushar   39
4    E05     Tarun   44
  EMP_ID  Salary
0    E01   35000
1    E02   45000
2    E03   55000
3    E04   65000
4    E05   75000

In [133]:
pd.merge(dd1, dd2, how="left", on="EMP_ID") #left join

  EMP_ID     Names  Age  Salary
0    E01       Ram   34   35000
1    E02     Shyam   44   45000
2    E03  Ghansham   35   55000
3    E04    Tushar   39   65000
4    E05     Tarun   44   75000

In [135]:
pd.merge(dd1, dd2, how="right", on="EMP_ID") #right join

  EMP_ID     Names  Age  Salary
0    E01       Ram   34   35000
1    E02     Shyam   44   45000
2    E03  Ghansham   35   55000
3    E04    Tushar   39   65000
4    E05     Tarun   44   75000

In [137]:
pd.merge(dd1, dd2, how="inner", on="EMP_ID") #inner join

  EMP_ID     Names  Age  Salary
0    E01       Ram   34   35000
1    E02     Shyam   44   45000
2    E03  Ghansham   35   55000
3    E04    Tushar   39   65000
4    E05     Tarun   44   75000

In [138]:
pd.merge(dd1, dd2, how="outer", on="EMP_ID") #outer join

  EMP_ID     Names  Age  Salary
0    E01       Ram   34   35000
1    E02     Shyam   44   45000
2    E03  Ghansham   35   55000
3    E04    Tushar   39   65000
4    E05     Tarun   44   75000

in merge if different column name

In [142]:
data5 = {"EMP_ID" : ["E01","E02","E03","E04","E05"],
         "Names" : ["Ram","Shyam","Ghansham","Tushar","Tarun"],
         "Age" : [34,44,35,39,44],
         }
data6 = {"EMPloyee_ID" : ["E01","E02","E03","E04","E05"],
         "Salary" :[35000, 45000, 55000,65000, 75000]
}
dd3 = pd.DataFrame(data5, index=[1,2,3,4,5])
dd4 = pd.DataFrame(data6,index=[1,2,3,4,5])
print(dd3)
print(dd4)

  EMP_ID     Names  Age
1    E01       Ram   34
2    E02     Shyam   44
3    E03  Ghansham   35
4    E04    Tushar   39
5    E05     Tarun   44
  EMPloyee_ID  Salary
1         E01   35000
2         E02   45000
3         E03   55000
4         E04   65000
5         E05   75000

In [141]:
pd.merge(dd3, dd4, how="inner", left_on="EMP_ID", right_on="EMPloyee_ID") #oleft on and right on when column name different

  EMP_ID     Names  Age EMPloyee_ID  Salary
0    E01       Ram   34         E01   35000
1    E02     Shyam   44         E02   45000
2    E03  Ghansham   35         E03   55000
3    E04    Tushar   39         E04   65000
4    E05     Tarun   44         E05   75000

In [143]:
# join will join always based on index only
dd3.join(dd4)

  EMP_ID     Names  Age EMPloyee_ID  Salary
1    E01       Ram   34         E01   35000
2    E02     Shyam   44         E02   45000
3    E03  Ghansham   35         E03   55000
4    E04    Tushar   39         E04   65000
5    E05     Tarun   44         E05   75000

Concatination

In [148]:
pd.concat([dd3,dd4], axis= 0)  #inconcat pit dd1 and dd2 in [] nbrackets

  EMP_ID     Names   Age EMPloyee_ID   Salary
1    E01       Ram  34.0         NaN      NaN
2    E02     Shyam  44.0         NaN      NaN
3    E03  Ghansham  35.0         NaN      NaN
4    E04    Tushar  39.0         NaN      NaN
5    E05     Tarun  44.0         NaN      NaN
1    NaN       NaN   NaN         E01  35000.0
2    NaN       NaN   NaN         E02  45000.0
3    NaN       NaN   NaN         E03  55000.0
4    NaN       NaN   NaN         E04  65000.0
5    NaN       NaN   NaN         E05  75000.0

Groupby function

In [160]:
dd3 = pd.read_csv("D:/Python/jupyter/company2.csv")
print(dd3)

    EEID      Name gender  salary
0  EMP01    ayushi      F    1000
1  EMP02     rohit      M   25000
2  EMP03  pranjali      M   27000
3  EMP01    ayushi      F   20000
4  EMP05    ayushi      M   25000
5  EMP06     rohit      M    1111
6  EMP02     rohit      M   25000

In [176]:
dd4 =dd3.groupby(by="gender")["salary"]
dd4.sum()
# dd4.mean()

gender
F     21000
M    103111
Name: salary, dtype: int64

complex groupby

In [178]:
dd4 =dd3.groupby(by="gender").agg({"salary" : ["sum","mean","count"]})
print(dd4)

        salary
           sum     mean count
gender
F        21000  10500.0     2
M       103111  20622.2     5

In [181]:
dd4 =dd3.groupby(by="gender").agg({"salary" : ["sum","mean","count"],"gender" : "count"})
print(dd4)

        salary                gender
           sum     mean count  count
gender
F        21000  10500.0     2      2
M       103111  20622.2     5      5

In [184]:
dd4 =dd3.groupby(by=["gender", "Name"]).agg({"salary" : ["sum","mean","count"]})
print(dd4)

                salary
                   sum     mean count
gender Name
F      ayushi    21000  10500.0     2
M      ayushi    25000  25000.0     1
       pranjali  27000  27000.0     1
       rohit     51111  17037.0     3

Encoding error while importing #when we use csv file some characterset it might not read in that case encoding error ignore will ignore that

In [201]:
dd5= pd.read_csv("D:/Python/jupyter/company2.csv", encoding_errors= "ignore")
print(dd5)

    EEID      Name gender  salary
0  EMP01    ayushi      F    1000
1  EMP02     rohit      M   25000
2  EMP03  pranjali      M   27000
3  EMP01    ayushi      F   20000
4  EMP05    ayushi      M   25000
5  EMP06     rohit      M    1111
6  EMP02     rohit      M   25000

Insert and assign

In [200]:
dd5.insert(1, "City_t", ["Delhi", "Mumbai", "Kolkata", "Germany", "NY", "Bangalore", "Chennai"])
print(dd5)

    EEID     City_t     City_n      Name gender       City  salary
0  EMP01      Delhi      Delhi    ayushi      F      Delhi    1000
1  EMP02     Mumbai     Mumbai     rohit      M     Mumbai   25000
2  EMP03    Kolkata    Kolkata  pranjali      M   Kolcatta   27000
3  EMP01    Germany    Germany    ayushi      F    Germany   20000
4  EMP05         NY         NY    ayushi      M         NY   25000
5  EMP06  Bangalore  Bangalore     rohit      M  Bangalore    1111
6  EMP02    Chennai    Chennai     rohit      M     Channi   25000

In [197]:
dd5.assign( City_z =["Delhi", "Mumbai", "Kolkata", "Germany", "NY", "Bangalore", "Chennai"] )

    EEID     City_n      Name gender       City  salary     City_z
0  EMP01      Delhi    ayushi      F      Delhi    1000      Delhi
1  EMP02     Mumbai     rohit      M     Mumbai   25000     Mumbai
2  EMP03    Kolkata  pranjali      M   Kolcatta   27000    Kolkata
3  EMP01    Germany    ayushi      F    Germany   20000    Germany
4  EMP05         NY    ayushi      M         NY   25000         NY
5  EMP06  Bangalore     rohit      M  Bangalore    1111  Bangalore
6  EMP02    Chennai     rohit      M     Channi   25000    Chennai